{
  "location-tasks": [
    {
      "id": 1,
      "name": "Innkeeper",
      "imagePath": "https://drive.google.com/uc?export=view&id=12lIeu06Rq4hSqLXTmxLkUs2hDKtUURiT",
      "location": "Inn",
      "riddleHtml": "<p>Welcome Quester! We have been expecting you. Our sources tell us that you wish to leave the Kingdom of Impseye. An arduous journey, both bitter and sweet. There exists but one portal out of this world&mdash;hidden in the Treasure Room of Hotel Transylvania. To unlock this room, you will need to collect several Keys that are scattered across the Kingdom!</p>\n\n<p>Are you ready to begin your journey?</p>",
      "leftChoice": 2,
      "rightChoice": 3,
      "questItem": { "name": "Shika Tablet", "id": 1 },
      "correctAnswer": "eWVz",
      "successTextHtml": "<p>Take this with you. It is called a Shika Tablet. It will periodically update itself with Job Requests in the vicinity of the Keys. Look, it already has two Requests!</p>\n\n<p>You can either help the Bard finish a sonnet at <i>Pitcher Tree: Mild Blunt</i> or you can aid the Scribe with their word musings at <i>Tension Syntax</i>. Choose wisely! </p>",
      "farewellMessage": "<p>Mollz, it was great to work with you and see you evolve and grow. We&apos;ll all miss working with you and I hope you elicit tons of GGWPs in whatever you decide to do in the future. *hi5 emoji* *thumbs up emoji*</p>\n\n<p>Cheers,</p>\n<p>SK</p>\n\n\n\n<p>It was great working with you, Mollika!</p>\n\n<p>I will miss the intensely creative and hardworking individual you are. You changed Impact Science immensely and your contributions are unparalleled. I hope you have the adventure of a lifetime post this wonderful phase at Cactus!</p>\n\n<p>&mdash;Akshay"
    },
    {
      "id": 2,
      "name": "Bard",
      "imagePath": "https://drive.google.com/uc?export=view&id=1eq9rh4KFiyzXp-opnB4akZ_N-YeAiNPY",
      "riddleHtml": "<p>Welcome Quester, I appear to have partaken of too much of mead,<br> and now my eyes are so blurred that they cannot read!</p><p>Forgive me pray, for being so terse,<br> but willst thou help me complete this verse?</p><p> &quot;When they came after me with masterful deceit,<br> they broke down my lute, and-&quot; </p><p>What phrase completes this feat?</p>\n",
      "leftChoice": 4,
      "rightChoice": 5,
      "questItem": { "name": "Broken Lute", "id": 2 },
      "correctAnswer": "a2lja2VkIGluIG15IHRlZXRo",
      "successTextHtml": "<p>Ah! Sweet maiden, thou hast assisted me in my song.<br>For thy troubles this Broken Lute, kindly take along.</p> <p>You have two new Requests! You can either help the Swordsman with his blade in <i>Grouper Clash Blows</i> or assist the Apothecary perfect her dose for enchanting a maid in <i>Sweat of the Beguiled</i>.Choose wisely!\"",
      "location": "Pitcher Tree: Mild Blunt",
      "farewellMessage": "<p>Farewell, &quot;Bongo Bondhu,&quot; you will be missed. I wish you very good luck for your new adventure. And thank you so much for the <i>12ft ladder</i>!</p>\n<p>&mdash;Manjishtha </p>\n"
    },
    {
      "id": 3,
      "name": "Scribe",
      "imagePath": "https://drive.google.com/uc?export=view&id=12lIeu06Rq4hSqLXTmxLkUs2hDKtUURiT",
      "riddleHtml": "<p>Bah! Who disturbs me now in my reclusion. Can you not see I am at work?</p> Oh, it is <i>you</i>.</p><p>Quick, what is a solitary word, 5 letters long, which whether you behead it once or behead it twice, the meaning does not change?</p><p>Not that I require your assistance in this matter, for I am indeed capable of doing it myself. But if you could hazard a guess? Just so I can see if you are correct...</p>\n\n",
      "leftChoice": 5,
      "rightChoice": 6,
      "questItem": { "name": "Old Scroll", "id": 3 },
      "correctAnswer": "YWxvbmU=",
      "successTextHtml": "<p>Sigh, I guess I could give you this Old Scroll I&apos;ve got lying around. You knos, I only had difficulty with the riddle because my mind thinks at a highly advanced level. Not that I need to prove my wisdom to you or anything.</p><p>Do you want to stay a while and hang out maybe? Not that I like your company. Oh, you&apos; got to go? Alright, don&apos;t make a fuss about it. Go already!</p> \n\n<p>You have two new Requests! Go help the Swordsman with his blade in<i> Grouper Clash Blows</i> or help the farmer till her fields in<i> Pew Pew Gully</i>. Choose wisely!</p>",
      "location": "Tension Syntax",
      "farewellMessage": "<p>I have been lucky enough to be guided by you at Impact Science. I want to thank you for the very constructive and genuine feedback that you gave me on all my assignments, it has been immensely helpful. I have always admired the perfection and ease with which you work, and I wish you continue to be this source of inspiration! Thank you and wish you have a fulfilling journey ahead :) </p>\n<p>&mdash;Jayant </p>\n"
    },
    {
      "id": 4,
      "name": "Apothecary",
      "imagePath": "https://drive.google.com/uc?export=view&id=1cvH1CwH-nrGZ2x_kUU8YZTJvVP84vZpN",
      "riddleHtml": "<p>And who is that has wandered into my little shop? Hello dearie, will you not come a little closer, so that I may see you better? Tell me what it is you seek. Oh, you search for a way out of here. Well, maybe I shall help you... Or maybe you shall help me. I need one more ingredient for my draught, the heart of a maiden, brave and strong.</p><p>Let us see which way the chips will fall. If you unriddle me this, I shall assist you with a direct path towards Hotel Transylvania.</p>\n<p>I grow heavy with white berries from the oak or the hawthorne when lovers kiss beneath; ripe and filled with the destiny of marriage.</p><p>Tell me my name.</p>",
      "leftChoice": 14,
      "rightChoice": 7,
      "questItem": { "name": "Twenty-League Boots", "id": 4 },
      "correctAnswer": "bWlzdGxldG9l",
      "successTextHtml": "<p>A deal is a deal. Here are some Twenty-League Boots, if you use them, you can get to Hotel Transylvania in no time.</p><p>You have two new Requests! You can either assist the Baker in baking a cake at <i>Honeydew Trolley</i> or you can head straight to the Final Boss at <i>Blooper Flash Toes</i>. Choose wisely! ",
      "location": "Sweat of the Beguiled",
      "farewellMessage": "<p>Mollika, will miss you...loads! You&apos;ve been an integral part of Impact Science and I&apos;m so grateful for having you on our team. As you move ahead towards new journeys and new adventures, I wish you all the best and hope that you will keep us in your heart as we will you…</p>\n<p>&mdash;Shivanee</p>\n"
    },
    {
      "id": 5,
      "name": "Swordsman",
      "imagePath": "https://drive.google.com/uc?export=view&id=1-dVuRlwF1MVGPkRz2pra_vpCQlek4i-R",
      "riddleHtml": "<p>EEYAH! Thrust! Parry! Jump kick! Oberhau! Phew, battle is exhausting.</p><p>Yo, tap in for me, will you? I gotta take a leee-ook at uh, some clouds.</p><p>To tap in, tell me how many inches tall my pink, fluffy, red-shoed, KILLER&mdash;aaaah! Stop trying to eat me, man, I ain&apos;t got no powers!&mdash;of an opponent is!</p>",
      "leftChoice": 8,
      "rightChoice": 6,
      "questItem": { "name": "Jewel", "id": 5 },
      "correctAnswer": "dGhyZWU=",
      "successTextHtml": "<p>What a relief it is to relieve yourself. Amirite? That&apos;ll be the last time I empty an entire flagon before a fight.<br>You ready to tag out?Alright&mdash;get the heck away from me you pink demon, or I swear to God I&apos;m going to cut off that shoe and feed it to you! Bye Quester! Take this Jewel as my thanks!</p> <p>You havr two new Requests! You can either help the Banker do his accounts at <i>Pension Intact</i>or go help the Farmer till her fields at <i>Pew Pew Gully</i>. Choose wisely!",
      "location": "Grouper Clash Blows",
      "farewellMessage": "<p>Heya! Hasn&apos;t been long since I joined but I feel absolutely at home at IS and I really have to thank you for being there as a huge pillar beacon lighthouse space station of support. Take care and stay connected. Hope you have an amazing time ahead and wishing you all the best! GG </p>\n<p>&mdash;Somesh </p>\n"
    },
    {
      "id": 6,
      "name": "Farmer",
      "imagePath": "https://drive.google.com/uc?export=view&id=1O7xzuZbMvqCntOniYt4QKZUfdxJCiOj7",
      "riddleHtml": "<p>Gee, howdy. Welcome to my farm. You&apos;re right on time to go a-plantin&apos;. I&apos;ve been having me a right good hankerin&apos; for one of them pink fruits. Them ones with the white flesh and more seeds than a squirrel&apos;s cheeks at the start of winter. </p><p>Dagnabbit, I can&apos;t for the life of me remember what it&apos;s called. Say stranger, help feller out and tell me it&apos;s name?</p>",
      "leftChoice": 2,
      "rightChoice": 9,
      "questItem": { "name": "Pumpkin", "id": 6 },
      "correctAnswer": "ZHJhZ29uIGZydWl0",
      "successTextHtml": "<p>Well I do declare! Aren&apos;t you a clever chicken! Alrighty, off you go, there ain&apos;t no need to help me with the sowing. There&apos;s vigor yet in those old bag of bones. Now, take this Pumpkin with you. It cooks fast and makes a mighty good stew. You&apos;ll be fuller than a tick and that stew&apos;ll keep you more energy than a barn full of horses.</p><p>You have two new Requests! You can either help the Traveller find a way across the enchanted bridge in <i>Meddlers of Tartan</i> or help the Bard finish a poem in <i>Pitcher Tree: Mild Blunt</i>. Choose wisely!</p>",
      "location": "Pew Pew Gully",
      "farewellMessage": "<p>Mollikaaaa, that rare off/on&mdash;site Mumbai trip that I was initially dreading was extra fun because I got to know you and spend time with you. It has been great working with you this past year and bothering you with multiple uploads past deadlines. Here&apos;s wishing you just the right amount of GnTs and THE BESTESTESTESTEST of LUCK for whatever you do next <3 PS: Thx for Cat Pix. Will stalk your insta creepily, even more now. </p>\n<p>&mdash;Aditi </p>\n"
    },
    {
      "id": 7,
      "name": "Baker",
      "imagePath": "https://drive.google.com/uc?export=view&id=12lIeu06Rq4hSqLXTmxLkUs2hDKtUURiT",
      "riddleHtml": "<p>Helluuuuu! Welcome to my bakery, home of the kookiest, ukiest breads in Impseye. Are you feeling hungee? No? Uki, maybe you can help me bake a speshul cake they&apos;ve ordered over at the castle for a grand farewell party tonight!</p>\n\n<p>So, I&apos;ve got butter, sugar, and eggs, there&apos;s icing, yeast, milk, vanilla essence, and... oh nu, I seem to have forgotten something! What could it be?</p>",
      "leftChoice": 9,
      "rightChoice": 8,
      "questItem": { "name": "Jam Bun", "id": 7 },
      "correctAnswer": "ZmxvdXI=",
      "successTextHtml": "<p>Oh. Lel. I feel silly. How could I miss flour! Oogi, I&apos;ve got it from here. Why don'&apos;t you take this Jam Bun and go? Arre, take it anyway! You&apos;ve got a long journey ahead. Stop by the feast tonight if you have time, afterall you helped stop me from accidentally making a mousse instead of cake.</p> <p>You have two new Requests! Help the Traveller get past the enchanted bridge in <i>Meddlers of Tartan</i> or help the Banker do his accounts at <i>Pension Intact</i>. Choose wisely!</p>",
      "location": "Honeydew Trolley",
      "farewellMessage": "<p>I admire your work ethic and am grateful to have been under your wing for a bit here. Your gentle yet direct way of maneuvering situations and conversations is something I&apos;ll always look up to. May you always be happy and fulfilled, wherever life takes you! </p>\n<p>Best, always, </p>\n<p>Hera </p>\n"
    },
    {
      "id": 8,
      "name": "Banker",
      "imagePath": "https://drive.google.com/uc?export=view&id=12lIeu06Rq4hSqLXTmxLkUs2hDKtUURiT",
      "riddleHtml": "<p>Fair afternoon, Quester! You&apos;re the one I&apos;ve heard things about, aren&apos;t you? The one who&apos;s good at solving puzzles.</p><p>I&apos;ve lost half my notes. Can you help me with my conundrum? The Duchess has left half her money to her granddaughter and half that amount to her grandson. She left a sixth to her brother, and the remaining sum, 1000 Morah, to her neighbour. How many Morah did she leave altogether?</p>",
      "leftChoice": 11,
      "rightChoice": 10,
      "questItem": { "name": "Ingot", "id": 8 },
      "correctAnswer": "dHdlbHZlIHRob3VzYW5k",
      "successTextHtml": "<p>Great. Thanks for your help! Let me know what I can do in exchange. Maybe I can give you this Ingot? It&apos;s a bit rare, but I guess it&apos;ll be more useful for you than me.</p><p>You have two new Requests! You can either visit the listless Sorceress in <i>Pleiades</i>or help the Florist identify a flower in <i>Handsew Holly</i>. Choose wisely!</p>",
      "location": "Pension Intact",
      "farewellMessage": "<p>I only hope I can fit into the shoes you&apos;re leaving behind. It&apos;s funny how we haven&apos;t worked more closely together despite handling the same client market. Thanks for having patience with my mistakes (and even blunders!) and handling all the madness with a sense of humor that is perhaps unique to you. All the best for your new journey! <i>Hoyto abaar konodin dekha hobe </i> :) </p>\n<p>&mdash;Deep</p>\n"
    },
    {
      "id": 9,
      "name": "Traveller",
      "imagePath": "https://drive.google.com/uc?export=view&id=1vyeKUS4FN4CH9G-uioMXAeDIblRUchuZ",
      "riddleHtml": "<p>Hark! Who goes there! Oh, it&apos;s you, Quester.</p>Dost thou seek to cross the bridge as well? Well, this be a magical bridge with three doors. Thou canst not cross unlest thou picketh the right door&semi; the answer to this riddle. But beware&mdash;the wrong choice willst kill thee.</p><p> Sigh, but to mine mind it seems all three doors kill, and I hath not been brave enough to venture through any. Mayhap if we band together we canst slay that fell beast which guards the way. What? Thou shallst solve the riddle instead? Well, I shan&apos;t stop thee. But prithee, tell me the answer before thou leaves.</p> <p>The riddle reads so. &quot;The first door opens to a pit of bubbling lava. The second to a room with a ferocious lion that hath not eaten a morsel for six years. And the third, to a chamber filled with deadly vapour. Which door wouldst thou choose?&quot; One, two, or three?</p>",
      "leftChoice": 14,
      "rightChoice": 12,
      "questItem": { "name": "Oil Lamp", "id": 9 },
      "correctAnswer": "dHdv",
      "successTextHtml": "<p>What a wonder! Thou hast solved it! Best thou take this Oil Lamp then and pass forth. No! Do not unwrap it. This Oil Lamp has the power to charm anyone who looks directly at it. Once charmed, they will do your bidding. If you take this to Hotel Transylvania, you can charm the guards and proceed straight to Final Boss!</p>\n\n<p>You have two new Requests! You can either help the Portrait Painter paint the King in <i>Mention Binbag</i> or you head straight to face the Final Boss in <i>Blooper Flash Toes</i>. Choose wisely!</p>",
      "location": "Meddlers of Tartan",
      "farewellMessage": "<p>Molly-ka, it has been such a pleasure&mdash;both working with you and getting to know you outside of work. And I know that the best, most exciting stuff lies ahead! </p>\n<p>It will be weird not having you around, but we&apos;ll see each other each time we&apos;re in the same city. Until then, be real (IYKYK). </p>\n<p>&mdash;Avantika</p>\n"
    },
    {
      "id": 10,
      "name": "Sorceress",
      "imagePath": "https://drive.google.com/uc?export=view&id=1Hu0fIlOtaOYYSLRfVhDcXM3-zePX0Y8k",
      "riddleHtml": "<p>At last you have arrived to these hellish halls. That proptious purgatory mere steps away from your final goal.</p><p>As much as I like to watch you leave, I hate to see you go. So only when you answer these questions, shall I permit you to venture forward.</p><p>Who brings fresh breath to the stifling sorrows of Impseye?<br>Whose mind is skillful and thoughts incredibly deft?<br>Without whose company shall my days wither away in boredom?<br>Tell me without whom my metier would be bereft?</p>",
      "leftChoice": 13,
      "rightChoice": 14,
      "questItem": { "name": " Fairy Thimble", "id": 10 },
      "correctAnswer": "bWU=",
      "successTextHtml": "<p>Good. So you know. Remember it always. Now take this Fairy Thimble with you. It&apos;s a flower of darkest blue&mdash;the colour of space&mdash;so that you may remember in its depths the brightness of Pleiades.</p><p>You have two new Requests! You can either save some children from being eaten by the Forest Witch in <i>Asketh the Child</i> or proceed to the Final Boss at Hotel Transylvania in <i>Blooper Flash Toes</i>. Choose wisely!</p>",
      "location": "Pleiades",
      "farewellMessage": "<p>I am glad that our time at Impact Science overlapped. It's been a true pleasure, getting to know you. I hope that in all the good memories you carry from here, I will be one of them. I wish you the very best in all that you do, both professionally and otherwise. Keep in touch *Kirby with knife gif*</p>\n<p>&mdash;Aarti</p>\n"
    },
    {
      "id": 11,
      "name": "Florist",
      "imagePath": "https://drive.google.com/uc?export=view&id=1HzCoKsOZdCr_zJvdD54z7EcB2uxS6kOq",
      "riddleHtml": "<p>Good day Quester, I hath heard much of thee! Dost thy knowledge extend to the name of this exotic blossom I found growing behind the castle? &apos;Tis white with a yellow heart and strokes of violet paint its petals on the outside. &apos;Thas long stems to feed the bees with more ease. I ken thou knows, for thou hast been oft called a genius.</p>\n\n<p>So tell me genius, what is its genus?</p>",
      "leftChoice": 13,
      "rightChoice": 12,
      "questItem": { "name": "Aloe Vera", "id": 11 },
      "correctAnswer": "bGlsbGl1bQ==",
      "successTextHtml": "<p>For thy knowledge take this Aloe Vera. Mayest thou go in grace.</p><p>You have two new Requests! Help the Portrait Painter paint the King in <i>Mention Binbag</i> or save two little children from being eaten by the Forest Witch in <i>Asketh of the Child</i>. Choose wisely!</p>",
      "location": "Handsew Holly",
      "farewellMessage": "<p>As you leave our team and move on to new adventures, I wanted to take a moment to say farewell and express my gratitude for the time we shared together. Although we haven&apos;t had the opportunity to get to know each other on a personal level, I have always appreciated the work you have been doing. </p>\n<p>Have fun and good luck, </p>\n<p>Anvi </p>\n"
    },
    {
      "id": 12,
      "name": "Portrait Painter",
      "imagePath": "https://drive.google.com/uc?export=view&id=1Epx-TKe7ooBdI0WsuPYnV4T4ANn1VNey",
      "riddleHtml": "<p>Welcome Quester! May I be of service to thee this fine afternoon? Ah! You&apos;ve heard of the pickle I now find myself in? Thou is kind to come by. The King hath asked me to paint him on his throne like the Lady with an Ermine. But I knowest not what that is or who hath created it. If I knew who painted it, I perchance may enquire of them.</p><p>Dost thou know the full name of who painted this portrait?</p>\n",
      "leftChoice": 14,
      "rightChoice": 6,
      "questItem": { "name": "Acrylic Paint", "id": 12 },
      "correctAnswer": "bGVvbmFyZG8gZGEgdmluY2k=",
      "successTextHtml": "<p>Ah! da Vinci. That bloke from Venice. He hath come to the Kingdom of Impseye once, when the realms were open and they traded. This was before my time. But mine old sire had befriended him and left mine mother for him soon after.<br>Perchance the painting then must be here, perchance in my sire's workshop or the castle itself. I shall go look. Here, take this Acrylic Paint with thee as a token of my gratitude.</p>\n<p>You have two new Requests! Help the Farmer till her field at <i>Pew Pew Gully</i> or assist the Florist in indentifying a flower in <i>Handsew Holly</i>. Choose wisely</p>",
      "location": "Mention Binbag",
      "farewellMessage": "<p>Hey Mollika! It was always a delight working with you, breaking heads on creating masterpieces for RCS and the endless BRILL discussions over sketches! It&apos;s indeed a bummer you are leaving us and I will always remember the good old projects, the endless editing on one darn map on new years and many such projects! </p>\n<p>Wish u all the very best ahead and good luck. </p>\n<p>&mdash;Vinita </p>\n"
    },
    {
      "id": 13,
      "name": "Forest Witch",
      "imagePath": "https://drive.google.com/uc?export=view&id=1aJK5vVapzpyymrkuKMzYPcS90GLSrCeV",
      "riddleHtml": "<p>The children are mine, Quester! *cackles* Thou shalt not take them. I robbed them from their cradles with mine own clawed fingers. I laved their skin with mine own poxy tears. And now that that are ready and their youth ripe to harvest, you stand in my way demanding I hand them over? *spits* Thou must banish me to whence I came first&mdash;speak the magic word to negate my power, or die painfully at my hand, slowly withering as your corpse bears flower.</p><p>Tell me, Quester. What tastes better than it smells?</p>",
      "leftChoice": 14,
      "rightChoice": 10,
      "questItem": { "name": "Tweedledum and Tweedledee", "id": 13 },
      "correctAnswer": "dG9uZ3Vl",
      "successTextHtml": "<p>Thou hast won, Quester. Thou hast answered a question that no-one hath answered before. Thou hast freed me from my curse and I will no longer need the souls of children to survive.</p>\n\n<p>Take the Tweedles to their father, and go forth to the Final Boss with thy wit, wisdom, and might. Thou is mine saviour.<br> Goodbye, Quester!</p><p>You have two new Requests! You can either visit the listless Sorceress in <i>Pleiades</i> or you can face the Final Boss in <i>Hotel Transylvania</i>. Choose wisely!<p>",
      "location": "Asketh of the Child",
      "farewellMessage": "<p>This ain&apos;t any sort of goodbye because we&apos;re probably going to meet next weekend only :p And I hasn&apos;t been working with you for some time so I has already been missing you and your patience and kindness and creativity and everything else that not only made working with you a pleasure but also a grounding experience. So, good luck in your new workplace; I hope it treats you well. See ya soon in our make-believe worlds. <3 </p>\n<p>&mdash;Rachana</p>\n"
    },
    {
      "id": 14,
      "name": "Final Boss",
      "imagePath": "https://drive.google.com/uc?export=view&id=12lIeu06Rq4hSqLXTmxLkUs2hDKtUURiT",
      "riddleHtml": "<p>Let&apos;s do one last quiz before you go. If you answer this riddle you&apos; get the passcode to the treasure room that contains the portal out of here. here goes, are you listening?</p>\n\n<p>&quot;The first from every item you&apos;ve gained on the quest,<br>\nShall help you obtain the answer to my test. <br>\nLest you fall prey to chronology, <br>\nAllow me to provide some hints for thee. <br>\nThe twelfth from the banker, with his eye on a deal.<br>\nThe scribe and the traveller, two and six reveal.<br>\nThe florist and painter give you four and nine.<br>\nFrom the farmer, the very first can you divine.<br>\nThree and five come from the apothecary and witch.<br> \nFrom the innkeeper, you&apos;ll find, the last of this sitch.<br>\nTen and eleven come from the swordsman and baker.<br> \nThe bard will help in a second… if you make her.<br>\nAs for the sorceress, I have but this for thee.<br>\nThings are not as they seem, so look carefully.&quot;</p><p>Alright, good luck.</p>\n",
      "questItem": null,
      "correctAnswer": null,
      "successTextHtml": "<p>And now onto a new adventure!</p>",
      "location": "Blooper Flash Toes",
      "farewellMessage": "<p>https://bc-programming.com/blogs/wp-content/uploads/2009/12/its_dangerous_to_go_alone.gif </p><p>Best,</p><p>Shane</p>"
    }
  ]
}
